clear all
close all
clc
%产生N（0，1）正态分布的随机噪声
randn('seed',100);
%v=0.01*randn(1,16);%方差为0.1
v=sqrt(0.5)*randn(1,16);%方差为0.5
%产生M序列
L=15;
y1=1;y2=1;y3=1;y4=0;%四个移位寄存器的输出初始值
for i=1:L
    x1=xor(y3,y4);
    x2=y1;
    x3=y2;
    x4=y3;
    y(i)=y4;
    if y(i)>0.5
        u(i)=-1;%M序列的幅值为5
    else u(i)=1;
    end
    y1=x1;y2=x2;y3=x3;y4=x4;
end
figure(1);
stem(u),%绘制离散序列数据
grid on;
title('输入信号M序列');
%一般最小二乘辨识程序
Z=zeros(1,16);
for k=3:16
  Z(k)=-1.6*Z(k-1)-0.7*Z(k-2)+u(k-1)+0.4*u(k-2)+1*v(k);
end
figure(2);
plot([1:16],Z)
title('输出观测值');
grid on;
figure(3)
stem(Z);
grid on;
title('输出观测值z的经线图形');

%给出样本系数矩阵
 H=[-Z(2) -Z(1) u(2) u(1);
    -Z(3) -Z(2) u(3) u(2);
    -Z(4) -Z(3) u(4) u(3);
    -Z(5) -Z(4) u(5) u(4);
    -Z(6) -Z(5) u(6) u(5);
    -Z(7) -Z(6) u(7) u(6);
    -Z(8) -Z(7) u(8) u(7);
    -Z(9) -Z(8) u(9) u(8);
    -Z(10) -Z(9) u(10) u(9);
    -Z(11) -Z(10) u(11) u(10);
    -Z(12) -Z(11) u(12) u(11);
    -Z(13) -Z(12) u(13) u(12);
    -Z(14) -Z(13) u(14) u(13);
    -Z(15) -Z(14) u(15) u(14);];
%样本观测矩阵
Z=[Z(3);Z(4);Z(5);Z(6);Z(7);Z(8);Z(9);
    Z(10);Z(11);Z(12);Z(13);Z(14);Z(15);Z(16)];
%估计参数
c=inv(H'*H)*H'*Z;
%参数分离
a1=c(1)
a2=c(2)
b1=c(3)
b2=c(4)